Tekla Open API Reference for Tekla Structures 2025
Polygon Class
 The Polygon class represents a polygon object that has its corners at the given points.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Polygon
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Polygon
<SerializableAttribute>
Public NotInheritable Class Polygon
The Polygon type exposes the following members.
Constructors
Name | Description
Polygon
 Initializes a new polygon instance with empty attributes.
Top
Properties
Name | Description
Points
 The corners of the polygon.
Top
Fields
Name | Description
MAX_POLYGON_POINTS
 The maximum number of polygon points that is typically valid in Tekla Structures.
MIN_POLYGON_POINTS
 The minimum number of polygon points that is typically valid in Tekla Structures.
Top
See Also
Reference
Tekla.Structures.Model Namespace